package avm;

public class synaerio {
/*
 * 정의
 - 캔 음료 자판기이다.
 - 총 6가지의 음료를 담을 수 있다.
 - 자판기는 음료 매진 판단과 잔돈 반환을 해준다.

* 구성요소
 - 자판기의 높이 / 너비
 - 음료 (객체)의 이름 / 가격 / 수량 
 - 잔돈

* 기능 
 1. 메뉴 출력
 2. 돈 넣기
 3. 제품 선택
 4. 음료 반환
 5. 추가 구매 여부
 6. 잔돈 반환
 7. 매진 판단
 */
}
/*
 우리는 6가지의 음료수가 들어있는 자판기를 만든다. 
 메뉴는 코카콜라는 1000원,펩시콜라는 900원,환타파인애플은 800원,물은 500원,칠성사이다는 850원,하늘보리는 950원이다.
 메뉴가 나오고 먹고싶은 것이 보이면 돈을 넣고 음료를 뽑을 수 있다.
 돈을 넣으면 잔액을 볼 수 있다.
 제품을 선택하여 버튼을 누르면 제품이 나온다.
 잔액이 바뀐다.
 넣은 돈에서 제품의 가격을 뺀 나머지(잔돈)가 제품을 하나라도 살 수 있는 범위라면 메뉴가 다시 나오고 음료를 다시 고를 수 있다.
 잔돈이 음료를 하나도 살수 없는 범위라면 잔돈을 자동으로 반환해준다.
 잔돈이 반환되고 나서 사람이 뽑아간 음료수의 갯수가 자판기에 들어있는 전체 음료수의 갯수에서 빠진다.
 자판기에 들어있는 음료수의 갯수가 0이면 매진이라는 단어가 보이게 된다.
 
 */
